app/views/users/show.html.erb

    <%= render 'follow_form' if logged_in? %>
    <% if @user.comments.any? %>
---
SELECT  1 AS one FROM `comments` WHERE `comments`.`user_id` = 1051729545 LIMIT 1