app/controllers/account_activations_controller.rb

  def edit
    user = User.find_by(email: params[:email])
    if user && !user.activated? && user.authenticated?(:activation, params[:id])
      user.update_attribute(:activated, true)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'wrong' LIMIT 1
UPDATE `users` SET `users`.`activated` = 1, `users`.`activated_at` = '2015-10-01 03:12:28' WHERE `users`.`id` = 1051729545