app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @comment = current_user.comments.build if logged_in?
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  `comments`.* FROM `comments` WHERE (user_id = 102)  ORDER BY `comments`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `comments` WHERE `comments`.`user_id` = 102