app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 219734992 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`user_id` = 219734992  ORDER BY `comments`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `comments` WHERE `comments`.`user_id` = 219734992
---
  def show
    @user = User.find(params[:id])
    @comments = @user.comments.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `activation_digest`) VALUES ('Flavia Pennetta', 'flavia@example.com', '$2a$04$4pQobwDQGajMcti3EDoyTO9htS0MvS4k9FjuxRoNgb7jAdvXs0tm6', '2015-10-01 03:12:28', '2015-10-01 03:12:28', '$2a$04$K28/FUOSU.4Thts9edfZ0endfEWOcyX9fVU9nN7JYHp1MMRVyY1BG')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 124270461 LIMIT 1
UPDATE `users` SET `name` = 'Thom Yorke', `email` = 'tyorke@example.com', `updated_at` = '2015-10-01 03:12:29' WHERE `users`.`id` = 1051729544
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

DELETE FROM `users` WHERE `users`.`id` = 1051729544
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 219734992 LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy